Config/Enums/ChargeCorrectionTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ChargeCorrectionTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Correction</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Discount</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Complimentary</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/ChartsOfAccounts/ChartOfAccountsFO.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfAccounts>
		<Properties>
			<Name>ChartOfAccountsFO</Name>
			<ExtDimensionTypes>ChartOfCharacteristicTypes.ChartOfAccountCharacteristicTypes</ExtDimensionTypes>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>CodeBO</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AccountGroup</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AccountGroups</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ServiceType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ServiceTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DiscountType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AccountDiscountTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AccountType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AccountTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Department</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DepartmentCodes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DepartmentOrder</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ComplimentaryIncomeAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccountsFO</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ComplimentaryExpensesAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccountsFO</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DiscountIncomeAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccountsFO</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DiscountExpensesAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccountsFO</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsVATAccount</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AnalysisItem1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AnalysisItems1</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AnalysisItem2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AnalysisItems2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SortCode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>PostingsListSettings</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Account</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccountsFO</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Sign</Name>
							<Type>
								<v8:Type>cfg:EnumRef.AccountSigns</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Variable</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.PostingsListFormulas</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Symbol</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Formula</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PostingDescriptionTemplate</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>VATRate</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.VATRates</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfAccounts>
</MetaDataObject>

Config/CommonForms/tcManualCorrectionForm/Ext/Form/Module.bsl
#Region FormEventHandlers

// --------------------------------------------------------------------------------
&AtServer
Procedure OnCreateAtServer(pCancel, pStandardProcessing)
	// Fill form attributes from parameters
	If Parameters.Property("Charges") Then
		Charges.LoadValues(Parameters.Charges.UnloadValues());
	EndIf;
	If Charges.Count() > 0 Then
		For Each vChargesItem In Charges Do
			vChargeRef = vChargesItem.Value;
			If ValueIsFilled(vChargeRef) And ValueIsFilled(vChargeRef.Service) Then
				If ValueIsFilled(vChargeRef.Service.CorrectionService) Then
					CorrectionService = vChargeRef.Service.CorrectionService;
				EndIf;
				Break;
			EndIf;
		EndDo;
	EndIf;
	If Parameters.Property("Folio") Then
		Folio = Parameters.Folio;
	EndIf;
	If Parameters.Property("Amount") Then
		AmountBeforeCorrection = Parameters.Amount;
	EndIf;
	AmountAfterCorrection = AmountBeforeCorrection;
	CalculateCorrectionAmounts();
	SetDiscountTitle();
	ChargeCorrectionType = Enums.ChargeCorrectionTypes.Correction;
	SetChargeCorrectionTypeAppearance();
EndProcedure // OnCreateAtServer

#EndRegion

#Region FormHeaderItemsEventHandlers

// --------------------------------------------------------------------------------
&AtClient
Procedure CorrectionSignOnChange(pItem)
	CalculateCorrectionAmounts();
	SetDiscountTitle();
EndProcedure // CorrectionSignOnChange

// --------------------------------------------------------------------------------
&AtClient
Procedure CorrectionTypeOnChange(pItem)
	CalculateCorrectionAmounts();
	SetDiscountTitle();
EndProcedure // CorrectionTypeOnChange

// --------------------------------------------------------------------------------
&AtClient
Procedure DiscountOnChange(pItem)
	CalculateCorrectionAmounts();
EndProcedure // DiscountOnChange

// --------------------------------------------------------------------------------
&AtClient
Procedure AmountBeforeCorrectionOnChange(pItem)
	CalculateCorrectionAmounts();
EndProcedure // AmountBeforeCorrectionOnChange

#EndRegion

#Region Private

// --------------------------------------------------------------------------------
&AtServer
Procedure SetChargeCorrectionTypeAppearance()
	vAccountsCount = 0;
	vQry = New Query();
	vQry.Text = 
	"SELECT
	|	COUNT(ChartOfAccountsFO.Ref) AS AccCount
	|FROM
	|	ChartOfAccounts.ChartOfAccountsFO AS ChartOfAccountsFO
	|WHERE
	|	(ChartOfAccountsFO.ComplimentaryIncomeAccount <> &qEmptyAccount
	|			OR ChartOfAccountsFO.DiscountIncomeAccount <> &qEmptyAccount
	|			OR ChartOfAccountsFO.ComplimentaryExpensesAccount <> &qEmptyAccount
	|			OR ChartOfAccountsFO.DiscountExpensesAccount <> &qEmptyAccount)
	|	AND NOT ChartOfAccountsFO.DeletionMark
	|	AND (ChartOfAccountsFO.Hotel = &qHotel
	|			OR ChartOfAccountsFO.Hotel = &qEmptyHotel)";
	vQry.SetParameter("qEmptyAccount", ChartsOfAccounts.ChartOfAccountsFO.EmptyRef());
	vQry.SetParameter("qHotel", ?(ValueIsFilled(Folio), Folio.Hotel, SessionParameters.CurrentHotel));
	vQry.SetParameter("qEmptyHotel", Catalogs.Hotels.EmptyRef());
	vAccountsCountRows = vQry.Execute().Unload();
	If vAccountsCountRows.Count() > 0 Then
		vAccountsCountRow = vAccountsCountRows.Get(0);
		If vAccountsCountRow.AccCount <> Null And cmIsNumber(vAccountsCountRow.AccCount) Then
			vAccountsCount = vAccountsCountRow.AccCount;
		EndIf;
	EndIf;
	If vAccountsCount = 0 Then
		Items.ChargeCorrectionType.Visible = False;
	Else
		Items.ChargeCorrectionType.Visible = True;
	EndIf;
EndProcedure // SetChargeCorrectionTypeAppearance

// --------------------------------------------------------------------------------
&AtServer
Procedure ApplyCorrectionAtServer()
	If Charges.Count() = 0 Then
		Return;
	EndIf;
	
	vNumberOfCharges = Charges.Count();
	vNumberOfCharges = ?(vNumberOfCharges = 0, 1, vNumberOfCharges);
	
	vAvgAmount = Round(AmountBeforeCorrection/vNumberOfCharges, 2);
	
	BeginTransaction(DataLockControlMode.Managed);
	
	vRestOfCorrectionAmount = CorrectionAmount;
	For Each vChargesItem In Charges Do
		vBasisCharge = vChargesItem.Value;
		
		vDesiredChargeDate = '00010101';
		vChargeObj = vBasisCharge.Copy();
		vChargeObj.pmFillAuthorAndDate();
		If ValueIsFilled(vChargeObj.Hotel) And ValueIsFilled(vChargeObj.Hotel.AccountingDate) And 
		   BegOfDay(vChargeObj.Date) > BegOfDay(vChargeObj.Hotel.AccountingDate) Then
			vDesiredChargeDate = EndOfDay(vChargeObj.Hotel.AccountingDate);
			vChargeObj.Date = vDesiredChargeDate;
			vChargeObj.SetTime(AutoTimeMode.DontUse);
		EndIf;
		If Year(vBasisCharge.Date) <> Year(vChargeObj.Date) Then
			vChargeObj.SetNewNumber();
		EndIf;
		
		vChargeObj.IsAdditional = True;
		
		If ValueIsFilled(CorrectionService) Then
			vChargeObj.Service = CorrectionService;
		EndIf;
		If ValueIsFilled(vBasisCharge.ServiceDate) Then
			vChargeObj.ServiceDate = vBasisCharge.ServiceDate;
		Else
			vChargeObj.ServiceDate = vBasisCharge.Date;
		EndIf;
		
		vChargeObj.CorrectedCharge = vBasisCharge;
		vChargeObj.IsCorrection = True;
		vChargeObj.CorrectionDate = vBasisCharge.Date;
		vChargeObj.ChargeCorrectionType = ChargeCorrectionType;
		vChargeObj.RoomRevenueCharge = Undefined;
		vChargeObj.IsMergedToRoomRevenue = False;
		
		vChargeObj.ChargeTransfer = Undefined;
		
		vChargeObj.Remarks = TrimAll(Remarks);
		
		vChargeObj.AgentCommission = 0;
		vChargeObj.VATCommissionSum = 0;
		vChargeObj.AgentCommissionType = Undefined;
		vChargeObj.AgentCommissionServiceGroup = Undefined;
		vChargeObj.CommissionSum = 0;
		
		vChargeObj.DiscountSum = 0;
		vChargeObj.VATDiscountSum = 0;
		vChargeObj.Discount = 0;
		vChargeObj.DiscountCard = Undefined;
		vChargeObj.DiscountType = Undefined;
		vChargeObj.DiscountServiceGroup = Undefined;
		vChargeObj.DiscountConfirmationText = Undefined;
		
		vChargeObj.RoomsRented = 0;
		vChargeObj.BedsRented = 0;
		vChargeObj.AdditionalBedsRented = 0;
		vChargeObj.GuestDays = 0;
		vChargeObj.GuestsCheckedIn = 0;
		
		vChargeObj.RateSum = 0;
		vChargeObj.RateDiscountSum = 0;
		vChargeObj.RateCommissionSum = 0;
		
		vK1 = (vBasisCharge.Sum - vBasisCharge.DiscountSum)/?(vAvgAmount = 0, 1, vAvgAmount);
		If Charges.IndexOf(vChargesItem) = (Charges.Count() - 1) Then
			vChargeObj.Sum = vRestOfCorrectionAmount;
		Else
			vChargeObj.Sum = Round(CorrectionAmount/vNumberOfCharges*vK1, 2);
		EndIf;
		vRestOfCorrectionAmount = vRestOfCorrectionAmount - vChargeObj.Sum;
		vChargeObj.Price = 0;
		vChargeObj.Quantity = 0;
		vChargeObj.VATSum = cmCalculateVATSum(vChargeObj.VATRate, vChargeObj.Sum, vChargeObj.Date);
		
		vK2 = vChargeObj.Sum/(vBasisCharge.Sum - vBasisCharge.DiscountSum);
		vChargeObj.CommissionSum = ?(vChargeObj.Sum < 0, -1, 1) * Round(vBasisCharge.CommissionSum * vK2, 2);
		vChargeObj.VATCommissionSum = cmCalculateVATSum(vChargeObj.VATRate, vChargeObj.CommissionSum, vChargeObj.Date);
		
		vChargeObj.Write(DocumentWriteMode.Posting);
		
		If ValueIsFilled(vDesiredChargeDate) And vChargeObj.Date <> vDesiredChargeDate Then
			vChargeObj.Date = vDesiredChargeDate;
			vChargeObj.Write(DocumentWriteMode.Posting);
		EndIf;			
	EndDo;
	
	CommitTransaction();
EndProcedure // ApplyCorrectionAtServer

// --------------------------------------------------------------------------------
&AtClient
Procedure ApplyCorrection(pCommand)
	If CorrectionAmount = 0 Then
		ShowMessageBox(, NStr("en='Correction amount is zero!'; ru='Сумма коррекции равна нулю!'; de='Korrektursumme ist Null!'"));
		Return;
	EndIf;
	If Not ValueIsFilled(Folio) Then
		ShowMessageBox(, NStr("en='Folio is empty!'; ru='Не выбран лицевой счет!'; de='Folio nicht angegeben!'"));
		Return;
	EndIf;
	// Do processing
	ApplyCorrectionAtServer();
	// Notify changes
	Notify("Subsystem.Accounts.Changed", Folio, ThisForm);
	// Close form
	ThisForm.Close();
EndProcedure // ApplyCorrection

// --------------------------------------------------------------------------------
&AtServer
Procedure SetDiscountTitle()
	If CorrectionSign = 0 Then
		If CorrectionType = 0 Then
			Items.Discount.Title = NStr("en='Discount %'; ru='Скидка %'; de='Rabatt %'");
		Else
			Items.Discount.Title = NStr("en='Discount amount'; ru='Сумма скидки'; de='Rabatt Summe'");
		EndIf;
	Else
		If CorrectionType = 0 Then
			Items.Discount.Title = NStr("en='Extra %'; ru='Наценка %'; de='Aufpreis %'");
		Else
			Items.Discount.Title = NStr("en='Extra amount'; ru='Сумма наценки'; de='Aufpreis Summe'");
		EndIf;
	EndIf;
EndProcedure // SetDiscountTitle

// --------------------------------------------------------------------------------
&AtServer
Procedure CalculateCorrectionAmounts()
	If CorrectionType = 0 Then
		CorrectionAmount = Round(?(CorrectionSign = 0, -1, 1) * AmountBeforeCorrection * (Discount / 100), 2);
	Else
		CorrectionAmount = ?(CorrectionSign = 0, -1, 1) * Discount;
	EndIf;
	AmountAfterCorrection = AmountBeforeCorrection + CorrectionAmount;
EndProcedure // CalculateCorrectionAmount

#EndRegion
